## Preprocess MAANG companies stock market data

- Import libraries  
- Load raw data (CSV, API, etc.)  
- Handle missing values / duplicates  
- Feature engineering  
- Save processed data to file (e.g., `data/processed.csv`)

Dataset by SOUMENDRA PRASAD MOHANTY on Kaggle: https://www.kaggle.com/datasets/soumendraprasad/stock

In [7]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import os

In [3]:
raw_AAPL = pd.read_csv('data/Apple.csv')
raw_AAPL.head(3)

       Open      High       Low     Close  Adj Close     Volume        Date
0  0.936384  1.004464  0.907924  0.999442   0.850643  535796800  2000-01-03
1  0.966518  0.987723  0.903460  0.915179   0.778926  512377600  2000-01-04
2  0.926339  0.987165  0.919643  0.928571   0.790324  778321600  2000-01-05

In [17]:
# load all CSV files
data_path = "data/raw"
company_names = ["Microsoft", "Apple", "Amazon", "Netflix", "Google"]

dfs = {}

for name in company_names:
    file_path = os.path.join(data_path, f"{name}.csv")
    df = pd.read_csv(file_path)
    df["Company"] = name  # add identifier column
    dfs[name] = df

In [18]:
dfs["Microsoft"].head(3)

,Open,High,Low,Close,Adj Close,Volume,Date,Company
0,58.68750,59.3125,56.0000,58.28125,36.361576,53228400,2000-01-03,Microsoft
1,56.78125,58.5625,56.1250,56.31250,35.133263,54119000,2000-01-04,Microsoft
2,55.56250,58.1875,54.6875,56.90625,35.503712,64059600,2000-01-05,Microsoft

In [24]:
combined_df = pd.concat(dfs.values(), ignore_index=True)
combined_df.sample(3)

,Open,High,Low,Close,Adj Close,Volume,Date,Company
7749,4.682500,4.750000,4.467500,4.513929,3.841888,1125395600,2007-08-09,Apple
9551,24.987499,25.162500,24.855000,24.905001,22.287283,148204800,2014-10-06,Apple
20296,31.234285,31.545713,30.807142,31.459999,31.459999,15299200,2013-06-07,Netflix

In [ ]:
# check for missing values 
combined_df.isna().any().any()

np.False_

In [27]:
# pd date time and sort values
combined_df["Date"] = pd.to_datetime(combined_df["Date"])
combined_df = combined_df.sort_values(["Company", "Date"])

In [28]:
combined_df.to_csv("data/processed/maang_combined.csv", index=False)